Kelly-234/HUST.AIA.Control/Drivers/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_exti copy.h
/**
 ******************************************************************************
 * @file    stm32g4xx_ll_exti.h
 * @author  MCD Application Team
 * @brief   Header file of EXTI LL module.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32G4xx_LL_EXTI_H
#define __STM32G4xx_LL_EXTI_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx.h"

  /** @addtogroup STM32G4xx_LL_Driver
   * @{
   */

#if defined(EXTI)

/** @defgroup EXTI_LL EXTI
 * @{
 */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private Macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_Private_Macros EXTI Private Macros
 * @{
 */
/**
 * @}
 */
#endif /*USE_FULL_LL_DRIVER*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
  /** @defgroup EXTI_LL_ES_INIT EXTI Exported Init structure
   * @{
   */
  typedef struct
  {

    uint32_t Line_0_31; /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 0 to 31
                             This parameter can be any combination of @ref EXTI_LL_EC_LINE */

    uint32_t Line_32_63; /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 32 to 63
                              This parameter can be any combination of @ref EXTI_LL_EC_LINE */

    FunctionalState LineCommand; /*!< Specifies the new state of the selected EXTI lines.
                                      This parameter can be set either to ENABLE or DISABLE */

    uint8_t Mode; /*!< Specifies the mode for the EXTI lines.
                       This parameter can be a value of @ref EXTI_LL_EC_MODE. */

    uint8_t Trigger; /*!< Specifies the trigger signal active edge for the EXTI lines.
                          This parameter can be a value of @ref EXTI_LL_EC_TRIGGER. */
  } LL_EXTI_InitTypeDef;

/**
 * @}
 */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Constants EXTI Exported Constants
 * @{
 */

/** @defgroup EXTI_LL_EC_LINE LINE
 * @{
 */
#define LL_EXTI_LINE_0 EXTI_IMR1_IM0   /*!< Extended line 0 */
#define LL_EXTI_LINE_1 EXTI_IMR1_IM1   /*!< Extended line 1 */
#define LL_EXTI_LINE_2 EXTI_IMR1_IM2   /*!< Extended line 2 */
#define LL_EXTI_LINE_3 EXTI_IMR1_IM3   /*!< Extended line 3 */
#define LL_EXTI_LINE_4 EXTI_IMR1_IM4   /*!< Extended line 4 */
#define LL_EXTI_LINE_5 EXTI_IMR1_IM5   /*!< Extended line 5 */
#define LL_EXTI_LINE_6 EXTI_IMR1_IM6   /*!< Extended line 6 */
#define LL_EXTI_LINE_7 EXTI_IMR1_IM7   /*!< Extended line 7 */
#define LL_EXTI_LINE_8 EXTI_IMR1_IM8   /*!< Extended line 8 */
#define LL_EXTI_LINE_9 EXTI_IMR1_IM9   /*!< Extended line 9 */
#define LL_EXTI_LINE_10 EXTI_IMR1_IM10 /*!< Extended line 10 */
#define LL_EXTI_LINE_11 EXTI_IMR1_IM11 /*!< Extended line 11 */
#define LL_EXTI_LINE_12 EXTI_IMR1_IM12 /*!< Extended line 12 */
#define LL_EXTI_LINE_13 EXTI_IMR1_IM13 /*!< Extended line 13 */
#define LL_EXTI_LINE_14 EXTI_IMR1_IM14 /*!< Extended line 14 */
#define LL_EXTI_LINE_15 EXTI_IMR1_IM15 /*!< Extended line 15 */
#if defined(EXTI_IMR1_IM16)
#define LL_EXTI_LINE_16 EXTI_IMR1_IM16 /*!< Extended line 16 */
#endif                                 /* EXTI_IMR1_IM16 */
#define LL_EXTI_LINE_17 EXTI_IMR1_IM17 /*!< Extended line 17 */
#if defined(EXTI_IMR1_IM18)
#define LL_EXTI_LINE_18 EXTI_IMR1_IM18 /*!< Extended line 18 */
#endif                                 /* EXTI_IMR1_IM18 */
#define LL_EXTI_LINE_19 EXTI_IMR1_IM19 /*!< Extended line 19 */
#if defined(EXTI_IMR1_IM20)
#define LL_EXTI_LINE_20 EXTI_IMR1_IM20 /*!< Extended line 20 */
#endif                                 /* EXTI_IMR1_IM20 */
#if defined(EXTI_IMR1_IM21)
#define LL_EXTI_LINE_21 EXTI_IMR1_IM21 /*!< Extended line 21 */
#endif                                 /* EXTI_IMR1_IM21 */
#if defined(EXTI_IMR1_IM22)
#define LL_EXTI_LINE_22 EXTI_IMR1_IM22 /*!< Extended line 22 */
#endif                                 /* EXTI_IMR1_IM22 */
#define LL_EXTI_LINE_23 EXTI_IMR1_IM23 /*!< Extended line 23 */
#if defined(EXTI_IMR1_IM24)
#define LL_EXTI_LINE_24 EXTI_IMR1_IM24 /*!< Extended line 24 */
#endif                                 /* EXTI_IMR1_IM24 */
#if defined(EXTI_IMR1_IM25)
#define LL_EXTI_LINE_25 EXTI_IMR1_IM25 /*!< Extended line 25 */
#endif                                 /* EXTI_IMR1_IM25 */
#if defined(EXTI_IMR1_IM26)
#define LL_EXTI_LINE_26 EXTI_IMR1_IM26 /*!< Extended line 26 */
#endif                                 /* EXTI_IMR1_IM26 */
#if defined(EXTI_IMR1_IM27)
#define LL_EXTI_LINE_27 EXTI_IMR1_IM27 /*!< Extended line 27 */
#endif                                 /* EXTI_IMR1_IM27 */
#if defined(EXTI_IMR1_IM28)
#define LL_EXTI_LINE_28 EXTI_IMR1_IM28 /*!< Extended line 28 */
#endif                                 /* EXTI_IMR1_IM28 */
#if defined(EXTI_IMR1_IM29)
#define LL_EXTI_LINE_29 EXTI_IMR1_IM29 /*!< Extended line 29 */
#endif                                 /* EXTI_IMR1_IM29 */
#if defined(EXTI_IMR1_IM30)
#define LL_EXTI_LINE_30 EXTI_IMR1_IM30 /*!< Extended line 30 */
#endif                                 /* EXTI_IMR1_IM30 */
#if defined(EXTI_IMR1_IM31)
#define LL_EXTI_LINE_31 EXTI_IMR1_IM31     /*!< Extended line 31 */
#endif                                     /* EXTI_IMR1_IM31 */
#define LL_EXTI_LINE_ALL_0_31 EXTI_IMR1_IM /*!< All Extended line not reserved*/

