Kelly-234/HUST.AIA.Control/Drivers/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_exti copy.h
#if defined(EXTI_IMR2_IM32)
#define LL_EXTI_LINE_32 EXTI_IMR2_IM32 /*!< Extended line 32 */
#endif                                 /* EXTI_IMR2_IM32 */
#if defined(EXTI_IMR2_IM33)
#define LL_EXTI_LINE_33 EXTI_IMR2_IM33 /*!< Extended line 33 */
#endif                                 /* EXTI_IMR2_IM33 */
#if defined(EXTI_IMR2_IM34)
#define LL_EXTI_LINE_34 EXTI_IMR2_IM34 /*!< Extended line 34 */
#endif                                 /* EXTI_IMR2_IM34 */
#if defined(EXTI_IMR2_IM35)
#define LL_EXTI_LINE_35 EXTI_IMR2_IM35 /*!< Extended line 35 */
#endif                                 /* EXTI_IMR2_IM35 */
#if defined(EXTI_IMR2_IM36)
#define LL_EXTI_LINE_36 EXTI_IMR2_IM36 /*!< Extended line 36 */
#endif                                 /* EXTI_IMR2_IM36 */
#if defined(EXTI_IMR2_IM37)
#define LL_EXTI_LINE_37 EXTI_IMR2_IM37 /*!< Extended line 37 */
#endif                                 /* EXTI_IMR2_IM37 */
#if defined(EXTI_IMR2_IM38)
#define LL_EXTI_LINE_38 EXTI_IMR2_IM38 /*!< Extended line 38 */
#endif                                 /* EXTI_IMR2_IM38 */
#if defined(EXTI_IMR2_IM39)
#define LL_EXTI_LINE_39 EXTI_IMR2_IM39 /*!< Extended line 39 */
#endif                                 /* EXTI_IMR2_IM39 */
#if defined(EXTI_IMR2_IM40)
#define LL_EXTI_LINE_40 EXTI_IMR2_IM40 /*!< Extended line 40 */
#endif                                 /* EXTI_IMR2_IM40 */
#if defined(EXTI_IMR2_IM41)
#define LL_EXTI_LINE_41 EXTI_IMR2_IM41 /*!< Extended line 41 */
#endif                                 /* EXTI_IMR2_IM41 */
#if defined(EXTI_IMR2_IM42)
#define LL_EXTI_LINE_42 EXTI_IMR2_IM42      /*!< Extended line 42 */
#endif                                      /* EXTI_IMR2_IM42 */
#define LL_EXTI_LINE_ALL_32_63 EXTI_IMR2_IM /*!< All Extended line not reserved*/

#define LL_EXTI_LINE_ALL (0xFFFFFFFFU) /*!< All Extended line */

#if defined(USE_FULL_LL_DRIVER)
#define LL_EXTI_LINE_NONE 0x00000000U /*!< None Extended line */
#endif                                /*USE_FULL_LL_DRIVER*/

/**
 * @}
 */
#if defined(USE_FULL_LL_DRIVER)

/** @defgroup EXTI_LL_EC_MODE Mode
 * @{
 */
#define LL_EXTI_MODE_IT ((uint8_t)0x00U)       /*!< Interrupt Mode */
#define LL_EXTI_MODE_EVENT ((uint8_t)0x01U)    /*!< Event Mode */
#define LL_EXTI_MODE_IT_EVENT ((uint8_t)0x02U) /*!< Interrupt & Event Mode */
/**
 * @}
 */

/** @defgroup EXTI_LL_EC_TRIGGER Edge Trigger
 * @{
 */
#define LL_EXTI_TRIGGER_NONE ((uint8_t)0x00U)           /*!< No Trigger Mode */
#define LL_EXTI_TRIGGER_RISING ((uint8_t)0x01U)         /*!< Trigger Rising Mode */
#define LL_EXTI_TRIGGER_FALLING ((uint8_t)0x02U)        /*!< Trigger Falling Mode */
#define LL_EXTI_TRIGGER_RISING_FALLING ((uint8_t)0x03U) /*!< Trigger Rising & Falling Mode */

  /**
   * @}
   */

#endif /*USE_FULL_LL_DRIVER*/

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Macros EXTI Exported Macros
 * @{
 */

/** @defgroup EXTI_LL_EM_WRITE_READ Common Write and read registers Macros
 * @{
 */

/**
 * @brief  Write a value in EXTI register
 * @param  __REG__ Register to be written
 * @param  __VALUE__ Value to be written in the register
 * @retval None
 */
#define LL_EXTI_WriteReg(__REG__, __VALUE__) WRITE_REG(EXTI->__REG__, (__VALUE__))

/**
 * @brief  Read a value in EXTI register
 * @param  __REG__ Register to be read
 * @retval Register value
 */
#define LL_EXTI_ReadReg(__REG__) READ_REG(EXTI->__REG__)
  /**
   * @}
   */

  /**
   * @}
   */

  /* Exported functions --------------------------------------------------------*/
  /** @defgroup EXTI_LL_Exported_Functions EXTI Exported Functions
   * @{
   */
  /** @defgroup EXTI_LL_EF_IT_Management IT_Management
   * @{
   */

  /**
   * @brief  Enable ExtiLine Interrupt request for Lines in range 0 to 31
   * @note The reset value for the direct or internal lines (see RM)
   *       is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR1         IMx           LL_EXTI_EnableIT_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   *         @arg @ref LL_EXTI_LINE_ALL_0_31
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableIT_0_31(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->IMR1, ExtiLine);
  }
  /**
   * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63
   * @note The reset value for the direct lines (lines from 32 to 34, line
   *       39) is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR2         IMx           LL_EXTI_EnableIT_32_63
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableIT_32_63(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->IMR2, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Interrupt request for Lines in range 0 to 31
   * @note The reset value for the direct or internal lines (see RM)
   *       is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR1         IMx           LL_EXTI_DisableIT_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31
   *         @arg @ref LL_EXTI_LINE_ALL_0_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableIT_0_31(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->IMR1, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63
   * @note The reset value for the direct lines (lines from 32 to 34, line
   *       39) is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR2         IMx           LL_EXTI_DisableIT_32_63
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableIT_32_63(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->IMR2, ExtiLine);
  }

  /**
   * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 0 to 31
   * @note The reset value for the direct or internal lines (see RM)
   *       is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR1         IMx           LL_EXTI_IsEnabledIT_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   *         @arg @ref LL_EXTI_LINE_ALL_0_31
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT_0_31(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->IMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63
   * @note The reset value for the direct lines (lines from 32 to 34, line
   *       39) is set to 1 in order to enable the interrupt by default.
   *       Bits are set automatically at Power on.
   * @rmtoll IMR2         IMx           LL_EXTI_IsEnabledIT_32_63
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT_32_63(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->IMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @}
   */

  /** @defgroup EXTI_LL_EF_Event_Management Event_Management
   * @{
   */

  /**
   * @brief  Enable ExtiLine Event request for Lines in range 0 to 31
   * @rmtoll EMR1         EMx           LL_EXTI_EnableEvent_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31
   *         @arg @ref LL_EXTI_LINE_ALL_0_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableEvent_0_31(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->EMR1, ExtiLine);
  }

  /**
   * @brief  Enable ExtiLine Event request for Lines in range 32 to 63
   * @rmtoll EMR2         EMx           LL_EXTI_EnableEvent_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableEvent_32_63(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->EMR2, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Event request for Lines in range 0 to 31
   * @rmtoll EMR1         EMx           LL_EXTI_DisableEvent_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   *         @arg @ref LL_EXTI_LINE_ALL_0_31
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableEvent_0_31(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->EMR1, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Event request for Lines in range 32 to 63
   * @rmtoll EMR2         EMx           LL_EXTI_DisableEvent_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableEvent_32_63(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->EMR2, ExtiLine);
  }

  /**
   * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 0 to 31
   * @rmtoll EMR1         EMx           LL_EXTI_IsEnabledEvent_0_31
   * @param  ExtiLine This parameter can be one of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_17
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_23
   *         @arg @ref LL_EXTI_LINE_24
   *         @arg @ref LL_EXTI_LINE_25
   *         @arg @ref LL_EXTI_LINE_26
   *         @arg @ref LL_EXTI_LINE_27
   *         @arg @ref LL_EXTI_LINE_28
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31
   *         @arg @ref LL_EXTI_LINE_ALL_0_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledEvent_0_31(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->EMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 32 to 63
   * @rmtoll EMR2         EMx           LL_EXTI_IsEnabledEvent_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_34
   *         @arg @ref LL_EXTI_LINE_35 (*)
   *         @arg @ref LL_EXTI_LINE_36
   *         @arg @ref LL_EXTI_LINE_37
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   *         @arg @ref LL_EXTI_LINE_42(*)
   *         @arg @ref LL_EXTI_LINE_ALL_32_63
   * @note   (*): Available in some devices
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledEvent_32_63(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->EMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @}
   */

  /** @defgroup EXTI_LL_EF_Rising_Trigger_Management Rising_Trigger_Management
   * @{
   */

  /**
   * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range 0 to 31
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a rising edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_RTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll RTSR1        RTx           LL_EXTI_EnableRisingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableRisingTrig_0_31(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->RTSR1, ExtiLine);
  }

