Kelly-234/HUST.AIA.Control/Drivers/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_exti copy.h
  /**
   * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a rising edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_RTSR register, the
   *       pending bit is not set.Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll RTSR2        RTx           LL_EXTI_EnableRisingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableRisingTrig_32_63(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->RTSR2, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range 0 to 31
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a rising edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_RTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll RTSR1        RTx           LL_EXTI_DisableRisingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableRisingTrig_0_31(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->RTSR1, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a rising edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_RTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll RTSR2        RTx           LL_EXTI_DisableRisingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableRisingTrig_32_63(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->RTSR2, ExtiLine);
  }

  /**
   * @brief  Check if rising edge trigger is enabled for Lines in range 0 to 31
   * @rmtoll RTSR1        RTx           LL_EXTI_IsEnabledRisingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_0_31(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->RTSR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Check if rising edge trigger is enabled for Lines in range 32 to 63
   * @rmtoll RTSR2        RTx           LL_EXTI_IsEnabledRisingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_32_63(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->RTSR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @}
   */

