Kelly-234/HUST.AIA.Control/Drivers/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_exti copy.h
  /** @defgroup EXTI_LL_EF_Falling_Trigger_Management Falling_Trigger_Management
   * @{
   */

  /**
   * @brief  Enable ExtiLine Falling Edge Trigger for Lines in range 0 to 31
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a falling edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_FTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll FTSR1        FTx           LL_EXTI_EnableFallingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableFallingTrig_0_31(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->FTSR1, ExtiLine);
  }

  /**
   * @brief  Enable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a Falling edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_FTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for
   *       the same interrupt line. In this case, both generate a trigger
   *       condition.
   * @rmtoll FTSR2        FTx           LL_EXTI_EnableFallingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_EnableFallingTrig_32_63(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->FTSR2, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Falling Edge Trigger for Lines in range 0 to 31
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a Falling edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_FTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for the same interrupt line.
   *       In this case, both generate a trigger condition.
   * @rmtoll FTSR1        FTx           LL_EXTI_DisableFallingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableFallingTrig_0_31(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->FTSR1, ExtiLine);
  }

  /**
   * @brief  Disable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
   * @note The configurable wakeup lines are edge-triggered. No glitch must be
   *       generated on these lines. If a Falling edge on a configurable interrupt
   *       line occurs during a write operation in the EXTI_FTSR register, the
   *       pending bit is not set.
   *       Rising and falling edge triggers can be set for the same interrupt line.
   *       In this case, both generate a trigger condition.
   * @rmtoll FTSR2        FTx           LL_EXTI_DisableFallingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_DisableFallingTrig_32_63(uint32_t ExtiLine)
  {
    CLEAR_BIT(EXTI->FTSR2, ExtiLine);
  }

  /**
   * @brief  Check if falling edge trigger is enabled for Lines in range 0 to 31
   * @rmtoll FTSR1        FTx           LL_EXTI_IsEnabledFallingTrig_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_0_31(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->FTSR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Check if falling edge trigger is enabled for Lines in range 32 to 63
   * @rmtoll FTSR2        FTx           LL_EXTI_IsEnabledFallingTrig_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_32_63(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->FTSR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @}
   */

  /** @defgroup EXTI_LL_EF_Software_Interrupt_Management Software_Interrupt_Management
   * @{
   */

  /**
   * @brief  Generate a software Interrupt Event for Lines in range 0 to 31
   * @note If the interrupt is enabled on this line in the EXTI_IMR1, writing a 1 to
   *       this bit when it is at '0' sets the corresponding pending bit in EXTI_PR1
   *       resulting in an interrupt request generation.
   *       This bit is cleared by clearing the corresponding bit in the EXTI_PR1
   *       register (by writing a 1 into the bit)
   * @rmtoll SWIER1       SWIx          LL_EXTI_GenerateSWI_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_GenerateSWI_0_31(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->SWIER1, ExtiLine);
  }

  /**
   * @brief  Generate a software Interrupt Event for Lines in range 32 to 63
   * @note If the interrupt is enabled on this line in the EXTI_IMR2, writing a 1 to
   *       this bit when it is at '0' sets the corresponding pending bit in EXTI_PR2
   *       resulting in an interrupt request generation.
   *       This bit is cleared by clearing the corresponding bit in the EXTI_PR2
   *       register (by writing a 1 into the bit)
   * @rmtoll SWIER2       SWIx          LL_EXTI_GenerateSWI_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_GenerateSWI_32_63(uint32_t ExtiLine)
  {
    SET_BIT(EXTI->SWIER2, ExtiLine);
  }

  /**
   * @}
   */

  /** @defgroup EXTI_LL_EF_Flag_Management Flag_Management
   * @{
   */

  /**
   * @brief  Check if the ExtLine Flag is set or not for Lines in range 0 to 31
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR1          PIFx           LL_EXTI_IsActiveFlag_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsActiveFlag_0_31(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->PR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Check if the ExtLine Flag is set or not for  Lines in range 32 to 63
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR2          PIFx           LL_EXTI_IsActiveFlag_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t LL_EXTI_IsActiveFlag_32_63(uint32_t ExtiLine)
  {
    return ((READ_BIT(EXTI->PR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
  }

  /**
   * @brief  Read ExtLine Combination Flag for Lines in range 0 to 31
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR1          PIFx           LL_EXTI_ReadFlag_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval @note This bit is set when the selected edge event arrives on the interrupt
   */
  __STATIC_INLINE uint32_t LL_EXTI_ReadFlag_0_31(uint32_t ExtiLine)
  {
    return (uint32_t)(READ_BIT(EXTI->PR1, ExtiLine));
  }

  /**
   * @brief  Read ExtLine Combination Flag for  Lines in range 32 to 63
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR2          PIFx           LL_EXTI_ReadFlag_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval @note This bit is set when the selected edge event arrives on the interrupt
   */
  __STATIC_INLINE uint32_t LL_EXTI_ReadFlag_32_63(uint32_t ExtiLine)
  {
    return (uint32_t)(READ_BIT(EXTI->PR2, ExtiLine));
  }

  /**
   * @brief  Clear ExtLine Flags  for Lines in range 0 to 31
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR1          PIFx           LL_EXTI_ClearFlag_0_31
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_0
   *         @arg @ref LL_EXTI_LINE_1
   *         @arg @ref LL_EXTI_LINE_2
   *         @arg @ref LL_EXTI_LINE_3
   *         @arg @ref LL_EXTI_LINE_4
   *         @arg @ref LL_EXTI_LINE_5
   *         @arg @ref LL_EXTI_LINE_6
   *         @arg @ref LL_EXTI_LINE_7
   *         @arg @ref LL_EXTI_LINE_8
   *         @arg @ref LL_EXTI_LINE_9
   *         @arg @ref LL_EXTI_LINE_10
   *         @arg @ref LL_EXTI_LINE_11
   *         @arg @ref LL_EXTI_LINE_12
   *         @arg @ref LL_EXTI_LINE_13
   *         @arg @ref LL_EXTI_LINE_14
   *         @arg @ref LL_EXTI_LINE_15
   *         @arg @ref LL_EXTI_LINE_16
   *         @arg @ref LL_EXTI_LINE_18
   *         @arg @ref LL_EXTI_LINE_19
   *         @arg @ref LL_EXTI_LINE_20
   *         @arg @ref LL_EXTI_LINE_21
   *         @arg @ref LL_EXTI_LINE_22
   *         @arg @ref LL_EXTI_LINE_29
   *         @arg @ref LL_EXTI_LINE_30
   *         @arg @ref LL_EXTI_LINE_31 (*)
   * @note   (*): Available in some devices
   * @note   Please check each device line mapping for EXTI Line availability
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_ClearFlag_0_31(uint32_t ExtiLine)
  {
    WRITE_REG(EXTI->PR1, ExtiLine);
  }

  /**
   * @brief  Clear ExtLine Flags for  Lines in range 32 to 63
   * @note This bit is set when the selected edge event arrives on the interrupt
   *       line. This bit is cleared by writing a 1 to the bit.
   * @rmtoll PR2          PIFx           LL_EXTI_ClearFlag_32_63
   * @param  ExtiLine This parameter can be a combination of the following values:
   *         @arg @ref LL_EXTI_LINE_32 (*)
   *         @arg @ref LL_EXTI_LINE_33 (*)
   *         @arg @ref LL_EXTI_LINE_38
   *         @arg @ref LL_EXTI_LINE_39
   *         @arg @ref LL_EXTI_LINE_40
   *         @arg @ref LL_EXTI_LINE_41
   * @note   (*): Available in some devices
   * @retval None
   */
  __STATIC_INLINE void LL_EXTI_ClearFlag_32_63(uint32_t ExtiLine)
  {
    WRITE_REG(EXTI->PR2, ExtiLine);
  }

  /**
   * @}
   */

#if defined(USE_FULL_LL_DRIVER)
  /** @defgroup EXTI_LL_EF_Init Initialization and de-initialization functions
   * @{
   */

  uint32_t LL_EXTI_Init(LL_EXTI_InitTypeDef *EXTI_InitStruct);
  uint32_t LL_EXTI_DeInit(void);
  void LL_EXTI_StructInit(LL_EXTI_InitTypeDef *EXTI_InitStruct);

/**
 * @}
 */
#endif /* USE_FULL_LL_DRIVER */

  /**
   * @}
   */

  /**
   * @}
   */

#endif /* EXTI */

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif

#endif /* __STM32G4xx_LL_EXTI_H */
